src/DataProcessors/vsc_НастройкаПравилСозданияМенеджераОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>vsc_НастройкаПравилСозданияМенеджераОбмена</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Конвертация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конвертации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДляГотовыхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформыДляГенерацииEPF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/vsc_НастройкаПравилСозданияМенеджераОбмена/Ext/ManagerModule.bsl
Процедура ЗаписатьНастройки(Знач Конвертация, КаталогДляГотовыхФайлов, ВерсияПлатформыДляГенерацииEPF) Экспорт
	
	КлючОбъектаМенеджераНастроек = КлючОбъектаМенеджераНастроек(Конвертация);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъектаМенеджераНастроек, "КаталогДляГотовыхФайлов", 		КаталогДляГотовыхФайлов);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъектаМенеджераНастроек, "ВерсияПлатформыДляГенерацииEPF", 	ВерсияПлатформыДляГенерацииEPF);
	
КонецПроцедуры

Функция КлючОбъектаМенеджераНастроек(Знач КлючОбъекта)
	
	ОписаниеТиповСтрока 		= Новый ОписаниеТипов("Строка");
	
	УникальныйИдентификаторОбъекта = ОписаниеТиповСтрока.ПривестиЗначение(КлючОбъекта.УникальныйИдентификатор());
	
	Возврат "Справочники.Конвертации{" + УникальныйИдентификаторОбъекта + "}";
	
КонецФункции


Функция ПрочитатьНастройки(Знач Конвертация) Экспорт
	
	КлючОбъектаМенеджераНастроек = КлючОбъектаМенеджераНастроек(Конвертация);
	
	КаталогДляГотовыхФайлов 		= ХранилищеОбщихНастроек.Загрузить(КлючОбъектаМенеджераНастроек, "КаталогДляГотовыхФайлов"); 	
	ВерсияПлатформыДляГенерацииEPF 	= ХранилищеОбщихНастроек.Загрузить(КлючОбъектаМенеджераНастроек, "ВерсияПлатформыДляГенерацииEPF"); 	
	
	Настройки = Новый Структура;
	Настройки.Вставить("КаталогДляГотовыхФайлов",			КаталогДляГотовыхФайлов);
	Настройки.Вставить("ВерсияПлатформыДляГенерацииEPF",	ВерсияПлатформыДляГенерацииEPF);
	
	Возврат Настройки;
	
КонецФункции
